Repository: eyosialex/linked_farm
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: LinkedFarm
am: አግሪሊድ

source: Home
am: መነሻ

source: Sell Produce
am: ምርት ይሽጡ

source: My Products
am: የእኔ ምርቶች

# buyInputs
source: Buy Agricultural Inputs
am: የግብርና ግብዓቶችን ይግዙ

source: Market Prices
am: የገበያ ዋጋ

source: Messages
am: መልዕክቶች

source: Delivery Services
am: የማጓጓዣ አገልግሎቶች

source: Expert Advice
am: የባለሙያ ምክር

# landPlanner
source: My Land Planner
am: የመሬት እቅድ አውጪ

source: Welcome back!
am: እንኳን ደህና መጡ!

# manageFarm
source: Manage your farm and crops efficiently.
am: እርሻዎን እና ሰብሎችዎን በብቃት ያስተዳድሩ።

source: Select Language
am: ቋንቋ ይምረጡ

source: Farmer Dashboard
am: የአርሶ አደር ዳሽቦርድ

# loginSubTitle
source: Login to your account
am: ወደ መለያዎ ይግቡ

# emailHint
source: Enter your email
am: ኢሜልዎን ያስገቡ

# passwordHint
source: Enter your password
am: የይለፍ ቃልዎን ያስገቡ

# loginButton
source: Login
am: ግባ

# noAccount
source: Don't have an account?
am: መለያ የለዎትም?

# registerAction
source: Register
am: ይመዝገቡ

source: Forgot password?
am: የይለፍ ቃል ረስተዋል?

# fillAllFields
source: Please fill all fields
am: እባክዎ ሁሉንም መስኮች ይሙሉ

source: User not found
am: ተጠቃሚ አልተገኘም

source: Wrong password
am: የተሳሳተ የይለፍ ቃል

source: Invalid email
am: የተሳሳተ ኢሜል

source: User disabled
am: ተጠቃሚው ታግዷል

source: Something went wrong
am: ችግር ተፈጥሯል

# completeProfileSetup
source: Please complete your profile setup.
am: እባክዎ የመለያዎን ዝግጅት ያጠናቅቁ።

# completeProfile
source: Please complete your profile.
am: እባክዎ መገለጫዎን ያጠናቅቁ።

# registerSubTitle
source: Create your account
am: መለያዎን ይፍጠሩ

# fullNameHint
source: Enter your full name
am: ሙሉ ስምዎን ያስገቡ

# phoneHint
source: Enter your phone number
am: የስልክ ቁጥርዎን ያስገቡ

# selectRole
source: Select your role
am: ሚናዎን ይምረጡ

# roleFarmer
source: Farmer
am: አርሶ አደር

# roleVendor
source: Vendor
am: ነጋዴ

# roleAdvisor
source: Expert Advisor
am: አማካሪ ባለሙያ

# roleDelivery
source: Delivery
am: አቅራቢ/መልእክተኛ

# roleShopper
source: Shopper (Input Supplier)
am: ሾፐር (ግብዓት አቅራቢ)

# confirmPasswordHint
source: Confirm your password
am: የይለፍ ቃልዎን ያረጋግጡ

# registerButton
source: Register
am: ይመዝገቡ

# alreadyHaveAccount
source: Already have an account?
am: ቀድሞውኑ መለያ አለዎት?

# passwordsNotMatch
source: Passwords do not match
am: የይለፍ ቃላት አይዛመዱም

# passwordTooShort
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# registrationSuccess
source: Registration successful!
am: ምዝገባው በተሳካ ሁኔታ ተጠናቅቋል!

# emailInUse
source: Email already in use
am: ኢሜል አስቀድሞ ጥቅም ላይ ውሏል

# weakPassword
source: Password is too weak
am: የይለፍ ቃሉ በጣም ደካማ ነው

source: Invalid email address
am: የተሳሳተ የኢሜል አድራሻ

# completeProfileTitle
source: Complete Your Profile
am: መገለጫዎን ያጠናቅቁ

source: User not logged in
am: ተጠቃሚ አልገባም

source: User data not found
am: የተጠቃሚ ውሂብ አልተገኘም

# profileCompletedSuccess
source: Profile completed successfully!
am: መገለጫ በተሳካ ሁኔታ ተጠናቅቋል!

# profileCompletedFailed
source: Failed to complete profile
am: መገለጫውን ማጠናቀቅ አልተቻለም

# deliveryInfoTitle
source: Delivery Information
am: የማድረሻ መረጃ

# yourLocationLabel
source: Your location
am: የእርስዎ አካባቢ

# carTypeLabel
source: Car Type
am: የመኪና ዓይነት

# licenseIdLabel
source: Driven license id
am: የመንጃ ፍቃድ መታወቂያ

# reviewCompleteTitle
source: Review & Complete
am: ይገምግሙ እና ያጠናቅቁ

# reviewInfoLabel
source: Review your information:
am: መረጃዎን ይገምግሙ፡

# locationLabel
source: Location:
am: አካባቢ፡

# licenseIdPrefix
source: License ID:
am: የፍቃድ መታወቂያ፡

# carTypePrefix
source: Car Type:
am: የመኪና ዓይነት፡

# clickCompleteLabel
source: Click Complete to finish your profile setup.
am: የመገለጫ ዝግጅትዎን ለማጠናቀቅ አጠናቅቅ የሚለውን ይጫኑ።

# farmInfoTitle
source: Farm Information
am: የእርሻ መረጃ

# farmNameLabel
source: Farm Name
am: የእርሻ ስም

# farmLocationLabel
source: Farm Location
am: የእርሻ ቦታ

# farmSizeLabel
source: Farm Size (acres)
am: የእርሻ መጠን (በኤከር)

# cropsGrownLabel
source: Crops Grown
am: የሚመረቱ ሰብሎች

# cropsHint
source: e.g., Coffee, Maize, Vegetables
am: ለምሳሌ፡ ቡና፣ በቆሎ፣ አትክልት

# businessInfoTitle
source: Business Information
am: የንግድ መረጃ

# businessNameLabel
source: Business Name
am: የንግድ ስም

# businessTypeLabel
source: Business Type
am: የንግድ ዓይነት

# businessTypeHint
source: e.g., Supplier, Retailer, Wholesaler
am: ለምሳሌ፡ አቅራቢ፣ ቸርቻሪ፣ ጅምላ ሻጭ

# contactPersonLabel
source: Contact Person
am: ተጠሪ ሰው

# businessAddressLabel
source: Business Address
am: የንግድ አድራሻ

# productsServicesLabel
source: Products/Services
am: ምርቶች/አገልግሎቶች

# productsServicesHint
source: e.g., Fertilizers, Seeds, Equipment
am: ለምሳሌ፡ ማዳበሪያ፣ ዘር፣ መሳሪያዎች

# professionalProfileTitle
source: Professional Profile
am: የሙያ መገለጫ

# specializationLabel
source: Specialization
am: ልዩ ሙያ

# specializationHint
source: e.g., Crop Science, Animal Health
am: ለምሳሌ፡ የሰብል ሳይንስ፣ የእንስሳት ጤና

# experienceLabel
source: Experience (Years)
am: ልምድ (በዓመታት)

# qualificationLabel
source: Qualification / Degree
am: ደረጃ / ዲግሪ

source: Farmer Profile Setup
am: የአርሶ አደር መገለጫ ዝግጅት

source: Vendor Profile Setup
am: የነጋዴ መገለጫ ዝግጅት

# advisorProfileSetup
source: Expert Advisor Profile Setup
am: የአማካሪ ባለሙያ መገለጫ ዝግጅት

source: Shopper Profile Setup
am: የሾፐር መገለጫ ዝግጅት

# defaultProfileSetup
source: Profile Setup
am: የመገለጫ ዝግጅት

source: Welcome, {name}!
am: እንኳን ደህና መጡ፣ {name}!

# resetLinkSent
source: Reset link sent! Check your inbox.
am: የይለፍ ቃል መቀየሪያ ሊንክ ተልኳል! ኢሜልዎን ይፈትሹ።

# noAccountFound
source: No account found with this email.
am: በዚህ ኢሜል የተመዘገበ መለያ አልተገኘም።

source: Invalid email format.
am: የተሳሳተ የኢሜል ፎርማት።

# networkError
source: Network error. Please check your internet connection.
am: የኔትወርክ ስህተት። እባክዎ ኢንተርኔትዎን ያረጋግጡ።

# passwordRecoveryTitle
source: Password Recovery
am: የይለፍ ቃል መልሶ ማግኛ

# enterRegisteredEmail
source: Enter your registered email
am: የተመዘገበ ኢሜልዎን ያስገቡ

# emailAddressLabel
source: Email address
am: የኢሜል አድራሻ

# sendResetLinkButton
source: Send Reset Link
am: ሊንክ ላክ

# signUpAction
source: Sign up
am: ይመዝገቡ

# comingSoon
source: {feature} coming soon!
am: {feature} በቅርቡ ይቀርባል!

# productImagesTitle
source: Product Images
am: የምርት ምስሎች

# addPhotosTitle
source: Add Photos
am: ምስሎችን ያክሉ

source: Choose image source
am: የምስል ምንጭ ይምረጡ

# cameraAction
source: Camera
am: ካሜራ

# galleryAction
source: Gallery
am: ጋለሪ

# photoAddedSuccess
source: Photo added successfully
am: ምስል በተሳካ ሁኔታ ተጨምሯል

source: Error taking photo
am: ፎቶ በማንሳት ላይ ስህተት ተከስቷል

source: Error selecting images
am: ምስሎችን በመምረጥ ላይ ስህተት ተከስቷል

source: Photo removed
am: ምስል ተወግዷል

# locationSelectedSuccess
source: Location selected successfully
am: ቦታ በተሳካ ሁኔታ ተመርጧል

# enterProductName
source: Please enter product name
am: እባክዎ የምርት ስም ያስገቡ

# selectCategory
source: Please select a category
am: እባክዎ ምድብ ይምረጡ

# enterProductDescription
source: Please enter product description
am: እባክዎ የምርት መግለጫ ያስገቡ

# enterValidPrice
source: Please enter a valid price
am: እባክዎ ትክክለኛ ዋጋ ያስገቡ

# enterValidQuantity
source: Please enter a valid quantity
am: እባክዎ ትክክለኛ መጠን ያስገቡ

# selectLocation
source: Please select a location
am: እባክዎ ቦታ ይምረጡ

# enterSellerName
source: Please enter seller name
am: እባክዎ የሻጭ ስም ያስገቡ

# enterContactInfo
source: Please enter contact information
am: እባክዎ የመገናኛ መረጃ ያስገቡ

# addAtLeastOnePhoto
source: Please add at least one product photo
am: እባክዎ ቢያንስ አንድ የምርት ፎቶ ያክሉ

source: Uploading...
am: በመጫን ላይ...

# uploadingImagesCount
source: Uploading {count} new image(s)
am: {count} አዲስ ምስሎችን በመጫን ላይ

# takeAMoment
source: This may take a few moments
am: ይህ ጥቂት ጊዜ ሊወስድ ይችላል

# savedLocallySyncLater
source: Saved locally! Will sync when internet is back.
am: በአካባቢው ተቀምጧል! ኢንተርኔት ሲኖር ይላካል።

# errorTitle
source: Error
am: ስህተት

# okAction
source: OK
am: እሺ

# retryAction
source: Retry
am: እንደገና ይሞክሩ

# successTitle
source: Success!
am: ተሳክቷል!

# itemListedSuccess
source: {name} has been listed successfully!
am: {name} በተሳካ ሁኔታ ለገበያ ቀርቧል!

# imagesUploadedCloudinary
source: {count} image(s) uploaded to Cloudinary
am: {count} ምስሎች ተጭነዋል

# itemLiveMarketplace
source: Your item is now live on the marketplace.
am: ምርትዎ አሁን በገበያ ላይ ይገኛል።

# addAnotherAction
source: Add Another
am: ሌላ ጨምር

# doneAction
source: Done
am: ተጠናቀቀ

source: Form cleared
am: ቅጹ ጸድቷል

source: Product Information
am: የምርት መረጃ

# productNameLabel
source: Product Name *
am: የምርት ስም *

# categoryLabel
source: Category *
am: ምድብ *

source: Subcategory (Optional)
am: ንዑስ ምድብ (አማራጭ)

# descriptionLabel
source: Description *
am: መግለጫ *

# describeProductDetail
source: Describe your product in detail...
am: ስለ ምርቱ ዝርዝር መግለጫ ይስጡ...

# priceEtbLabel
source: Price (ETB) *
am: ዋጋ (በብር) *

# quantityLabel
source: Quantity *
am: መጠን *

# unitLabel
source: Unit
am: መመዘኛ

# conditionLabel
source: Condition
am: ሁኔታ

# locationTitle
source: Location
am: ቦታ

source: Location on Map *
am: ቦታ በካርታ ላይ *

source: Tap to select location
am: ቦታ ለመምረጥ ይጫኑ

source: Edit Product
am: ምርት ይቀይሩ

# sellProduceAction
source: Sell Produce
am: ምርት ይሽጡ

# addMorePhotos
source: Add More Photos ({count}/10)
am: ተጨማሪ ምስሎችን ያክሉ ({count}/10)

# deleteProductTitle
source: Delete Product
am: ምርት ይሰርዙ

# deleteProductConfirm
source: Are you sure you want to delete "{name}"?
am: "{name}" መሰረዝዎን እርግጠኛ ነዎት?

# cancelAction
source: Cancel
am: አይሁን

# deleteAction
source: Delete
am: ሰርዝ

# productDeletedSuccess
source: Product deleted successfully
am: ምርት በተሳካ ሁኔታ ተሰርዟል

# loginToViewProducts
source: Please login to view your products
am: ምርቶችዎን ለማየት እባክዎ ይግቡ

# myProductsTitle
source: My Products
am: የእኔ ምርቶች

# noProductsListed
source: You haven't listed any products yet
am: እስካሁን ምንም ምርት አላቀረቡም

# listFirstProductButton
source: List Your First Product
am: የመጀመሪያ ምርትዎን ያቅርቡ

# editAction
source: Edit
am: አስተካክል

# shareNearbyAction
source: Share with Nearby
am: ለአቅራቢያ ያካፍሉ

# viewsLabel
source: {count} Views
am: {count} እይታዎች

# likesLabel
source: {count} Likes
am: {count} ተወዳጅነት

# shareWifiTitle
source: Share via Wi-Fi
am: በዋይፋይ ያካፍሉ

# enterFarmerIpLabel
source: Enter the nearby farmer's IP address:
am: የአቅራቢያ አርሶ አደር IP አድራሻ ያስገቡ፡

source: Propagating to {ip}...
am: ወደ {ip} በመላክ ላይ...

# propagatedSuccess
source: Propagated successfully!
am: በተሳካ ሁኔታ ተልኳል!

# failedToConnectIp
source: Failed to connect to {ip}
am: ከ {ip} ጋር መገናኘት አልተቻለም

# sendAction
source: Send
am: ላክ

# catCereals
source: Cereals
am: ጥራጥሬዎች

# catPulses
source: Pulses
am: አተርና ባቄላ

# catVegetables
source: Vegetables
am: አትክልቶች

# catFruits
source: Fruits
am: ፍራፍሬዎች

# catSpices
source: Spices
am: ቅመማ ቅመሞች

# catCoffee
source: Coffee
am: ቡና

# catOilSeeds
source: Oil Seeds
am: የቅባት እህሎች

# catTubers
source: Tubers
am: ስርወ ምድሮች

# catLivestock
source: Livestock
am: የከብት እርባታ

# catOthers
source: Others
am: ሌሎች

# condFresh
source: Fresh
am: ትኩስ

# condDry
source: Dry
am: ደረቅ

# condOrganic
source: Organic
am: ተፈጥሯዊ

# condProcessed
source: Processed
am: የተቀነባበረ

# condFrozen
source: Frozen
am: የበረዶ

# unitKg
source: kg
am: ኪሎ

# unitQuintal
source: quintal
am: ኩንታል

# unitTon
source: ton
am: ቶን

# unitSack
source: sack
am: ጆንያ

# unitPiece
source: piece
am: ፍሬ

# unitLiter
source: liter
am: ሊትር

# addClearPhotosHint
source: Add clear photos of your product from different angles
am: ስለ ምርቱ ግልጽ ፎቶዎችን ከተለያዩ አቅጣጫዎች ያክሉ

source: Location not found
am: ቦታው አልተገኘም

# unableToFindLocation
source: Unable to find location. Please try again.
am: ቦታውን ለማግኘት አልተቻለም። እባክዎ እንደገና ይሞክሩ።

# searchLocationHint
source: Search location...
am: ቦታ ይፈልጉ...

# selectLocationTitle
source: Select Location
am: ቦታ ይምረጡ

# draggingStatus
source: Dragging...
am: በመጎተት ላይ...

# fetchingStatus
source: Fetching...
am: በመፈለግ ላይ...

# confirmLocationButton
source: Confirm Location
am: ቦታውን አረጋግጥ

source: Unknown Location
am: ያልታወቀ ቦታ

# catPesticide
source: Pesticide
am: ፀረ-ተባይ

# catHerbicide
source: Herbicide
am: ፀረ-አረም

# catFungicide
source: Fungicide
am: ፀረ-ፈንገስ

# catFertilizer
source: Fertilizer
am: ማዳበሪያ

# sellInputs
source: Sell Agricultural Inputs
am: የግብርና ግብዓቶችን ይሽጡ

source: Offline
am: ከመስመር ውጭ

source: Synced
am: ተ синхሮናይዝድ
